# EDA

### Importaciones

In [1]:
from helpers.helper import load_all, save_one
from classes.Peliculas import Pelicula
from classes.Usuarios import Usuario
from classes.Personas import Persona
from classes.Trabajadores import Trabajador
from classes.Scores import Score

import pandas as pd
from  matplotlib import pyplot as plt
from datetime import datetime

### Carga de dataframes

In [2]:
df_movies, df_people, df_scores, df_workers, df_users = load_all('data/peliculas.csv', 'data/personas.csv', 'data/scores.csv', 'data/trabajadores.csv', 'data/usuarios.csv')

## I. Películas

#### A. Instanciación de película

In [3]:
peli_1 = Pelicula(
    nombre='Pelicula mala',
    anio="01-Jan-1994",
    generos=['Comedy', 'Romance', 'Mystery'],
    imdb_url=None,
    id=None)

peli_1

#### B. Escribir película

In [4]:
new_df = peli_1.write_df(df_movies)

new_df

#### C. Guardar película

In [5]:
save_one('data/peliculas.csv', new_df)

#### D. Eliminar del dataframe

In [6]:
peli_1.id = 1683
new_df2 = peli_1.remove_from_df(new_df)

save_one('data/peliculas.csv', new_df2)

#### E. Buscar película

In [11]:
df_by_date = Pelicula.get_from_df(df_movies, anios=['01-Jan-1994','01-Jan-1995'])
df_by_id = Pelicula.get_from_df(df_movies, id=1500)
df_by_name = Pelicula.get_from_df(df_movies, nombre="Toy Story (1995)")
df_by_genre = Pelicula.get_from_df(df_movies, generos=['Adventure', 'Animation'])

#### F. Estadísticas

In [5]:

Pelicula.get_stats(df_movies, df_scores, anios=['01-Jan-1995', '01-Jan-2022'], generos=['Action'])

## Otras estadísticas

##### A. Scores:

In [6]:
df_group_by_year, df_group_by_gender, df_group_by_occupation = Score.get_stats(df_movies,df_scores, df_people, df_users)

print("\n\n Scores agrupados por año \n\n")
df_group_by_year.head()

# print("\n\n Scores agrupados por género \n\n")
# df_group_by_gender.head()

# print("\n\n Scores agrupados por ocupación \n\n")
# df_group_by_occupation.head()

##### B. Usuarios:

In [8]:
total_users, users_by_occupation, users_by_year_birth = Usuario.get_stats(df_people, df_users)

print("Cantidad total de usuarios")
print(total_users)

print("Usuarios por ocupación")
users_by_occupation

print("Usuarios por año de nacimiento")
users_by_year_birth

Cantidad total de usuarios
943

               id  Occupation  Active Since  Full Name  Gender  Zip Code
year of birth
1925            1           1             1          1       1         1
1928            3           3             3          3       3         3
1929            2           2             2          2       2         2
1930            2           2             2          2       2         2
1932            1           1             1          1       1         1
...            ..         ...           ...        ...     ...       ...
1984            3           3             3          3       3         3
1985            5           5             5          5       5         5
1987            1           1             1          1       1         1
1988            1           1             1          1       1         1
1991            1           1             1          1       1         1

[61 rows x 6 columns]

## Otras clases

#### A. Persona

In [14]:
persona = Persona(
  full_name="Nombre Apellido",
  year_of_birth="1989",
  gender="M",
  zipcode=1234
)

df_p = persona.write_df(df_people)
df1_p = persona.remove_from_df(df_p)

#### B. Usuario

In [5]:
usuario = Usuario(
  occupation="Profesor",
  active_since=datetime.now(),
  id=None,
  full_name="Nombre Apellido",
  year_of_birth="1989",
  gender="M",
  zipcode=1234
)

df_u = usuario.write_df(df_users)
df1_u = usuario.remove_from_df(df_u)

          id  user_id  movie_id  rating                 Date
0          0      196       242       3  1997-12-04 15:55:49
1          1      186       302       3  1998-04-04 19:22:22
2          2       22       377       1  1997-11-07 07:18:36
3          3      244        51       2  1997-11-27 05:02:03
4          4      166       346       1  1998-02-02 05:33:16
...      ...      ...       ...     ...                  ...
99995  99995      880       476       3  1997-11-22 05:10:44
99996  99996      716       204       5  1997-11-17 19:39:03
99997  99997      276      1090       1  1997-09-20 22:49:55
99998  99998       13       225       2  1997-12-17 22:52:36
99999  99999       12       203       3  1997-11-19 17:13:03

[100000 rows x 5 columns]

#### C. Trabajador

In [15]:
trabajador = Trabajador(
  position ="Analyst", 
  category ="b", 
  working_hours=9, 
  start_date="1998-03-30",
  full_name="Nombre Apellido",
  year_of_birth="1989",
  gender="M",
  zipcode=1234
)

df_w = trabajador.write_df(df_workers)
df_w2 =trabajador.remove_from_df(df_w)

#### D. Scores

In [ ]:
score = Score(
  user_id=1, 
  movie_id=2, 
  rating=3, 
  date="1997-12-04 15:55:49", 
  id=None
)

df_s = score.write_df(df_scores)
df_s2 =score.remove_from_df(df_s)